app/controllers/sessions_controller.rb

  def authy_callback
    authy_id = params[:authy_id]
    begin
      @user = User.find_by! authy_id: authy_id
      @user.update(authy_status: params[:status])
---
SELECT  "users".* FROM "users" WHERE "users"."authy_id" = $1 LIMIT 1  [["authy_id", "5588010"]]
UPDATE "users" SET "authy_status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["authy_status", 5], ["updated_at", "2015-10-14 18:54:14.052097"], ["id", 1]]

  def one_touch_status
    @user = User.find(session[:pre_2fa_auth_user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def send_token
    @user = User.find(session[:pre_2fa_auth_user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def verify
    @user = User.find(session[:pre_2fa_auth_user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def resend
    @user = User.find(session[:pre_2fa_auth_user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]