app/controllers/sessions_controller.rb

UPDATE "users" SET "authy_status" = $1, "uuid" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["authy_status", 1], ["uuid", "c36f60c0-54ce-0133-729e-0e67b818e6fb"], ["updated_at", "2015-10-14 18:24:42.204317"], ["id", 1]]
---
  def create
    @user = User.find_by(email: params[:email])
    if @user && @user.authenticate(params[:password])
      session[:pre_2fa_auth_user_id] = @user.id

      # Try to verify with OneTouch
      one_touch = Authy::OneTouch.send_approval_request(
        id: @user.authy_id,
        message: "Request to Login to Twilio demo app",
        details: {
          'Email Address' => @user.email,
        }
      )
      status = one_touch.approval_request ? :onetouch : :sms
      @user.update(authy_status: status)